src_Extension/InformationRegisters/mcp_ИсторияДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>mcp_ИсторияДиалогов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованныеИнструменты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_Extension/CommonModules/mcp_АгентОбработчик/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обрабатывает запрос пользователя и возвращает ответ агента
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса пользователя
//  Пользователь - СправочникСсылка.Пользователи - пользователь, отправивший запрос
//  Сессия - Строка - идентификатор сессии диалога
//  Параметры - Структура - дополнительные параметры (необязательно)
//
// Возвращаемое значение:
//  Структура - результат обработки:
//   * Успешно - Булево
//   * ТекстОтвета - Строка - текст ответа агента
//   * ИспользованныеИнструменты - Массив - список использованных инструментов
//   * Ошибка - Строка - текст ошибки (если Успешно = Ложь)
//
Функция ОбработатьЗапросПользователя(ТекстЗапроса, Пользователь, Сессия, Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТекстОтвета", "");
	Результат.Вставить("ИспользованныеИнструменты", Новый Массив);
	Результат.Вставить("Ошибка", "");
	
	Попытка
		// Сохраняем запрос пользователя в историю
		ДобавитьСообщениеВИсторию(Пользователь, Сессия, "user", ТекстЗапроса);
		
		// Получаем историю диалога
		ИсторияДиалога = ПолучитьИсториюДиалога(Пользователь, Сессия);
		
		// Анализируем запрос на необходимость использования инструментов
		НеобходимыеИнструменты = ОпределитьНеобходимыеИнструменты(ТекстЗапроса, ИсторияДиалога);
		
		// Выполняем инструменты, если нужно
		РезультатыИнструментов = Новый Структура;
		ИспользованныеИнструменты = Новый Массив;
		
		Если НеобходимыеИнструменты.Количество() > 0 Тогда
			Для Каждого Инструмент Из НеобходимыеИнструменты Цикл
				Попытка
					РезультатИнструмента = ВыполнитьИнструментMCP(Инструмент.Имя, Инструмент.Параметры);
					РезультатыИнструментов.Вставить(Инструмент.Имя, РезультатИнструмента);
					ИспользованныеИнструменты.Добавить(Инструмент.Имя);
				Исключение
					РезультатыИнструментов.Вставить(Инструмент.Имя, 
						СтрШаблон("Ошибка выполнения инструмента: %1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		// Формируем контекст для модели
		КонтекстИнструментов = СформироватьКонтекстИнструментов(РезультатыИнструментов);
		
		// Добавляем результаты инструментов в историю как системное сообщение
		Если ЗначениеЗаполнено(КонтекстИнструментов) Тогда
			СистемноеСообщение = "Результаты выполнения инструментов:" + Символы.ПС + КонтекстИнструментов;
			ДобавитьСообщениеВИсторию(Пользователь, Сессия, "system", СистемноеСообщение);
		КонецЕсли;
		
		// Получаем обновленную историю
		ИсторияДиалога = ПолучитьИсториюДиалога(Пользователь, Сессия);
		
		// Формируем сообщения для модели
		Сообщения = mcp_АгентLMStudio.СформироватьСообщенияДляМодели(ИсторияДиалога);
		
		// Отправляем запрос к модели
		ОтветМодели = mcp_АгентLMStudio.ОтправитьЗапросКМодели(Сообщения, Параметры);
		
		Если ОтветМодели.Успешно Тогда
			Результат.Успешно = Истина;
			Результат.ТекстОтвета = ОтветМодели.ТекстОтвета;
			Результат.ИспользованныеИнструменты = ИспользованныеИнструменты;
			
			// Сохраняем ответ в историю
			ДобавитьСообщениеВИсторию(Пользователь, Сессия, "assistant", ОтветМодели.ТекстОтвета, ИспользованныеИнструменты);
		Иначе
			Результат.Ошибка = ОтветМодели.Ошибка;
		КонецЕсли;
		
	Исключение
		Результат.Ошибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("MCP.Агент", УровеньЖурналаРегистрации.Ошибка, , , 
			СтрШаблон("Ошибка обработки запроса: %1", Результат.Ошибка));
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Определяет, какие инструменты нужно использовать для запроса
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса пользователя
//  ИсторияДиалога - ТаблицаЗначений - история диалога
//
// Возвращаемое значение:
//  Массив - массив структур с полями:
//   * Имя - Строка - имя инструмента
//   * Параметры - Структура - параметры для инструмента
//
Функция ОпределитьНеобходимыеИнструменты(ТекстЗапроса, ИсторияДиалога = Неопределено) Экспорт
	
	НеобходимыеИнструменты = Новый Массив;
	
	ТекстЗапросаВерхний = ВРег(ТекстЗапроса);
	
	// Получаем список доступных инструментов
	ТаблицаИнструментов = mcp_КонтейнерыПовтИсп.Инструменты();
	
	// Простой анализ по ключевым словам
	// В будущем можно улучшить, используя саму модель для определения инструментов
	
	Для Каждого СтрокаИнструмента Из ТаблицаИнструментов Цикл
		ИмяИнструмента = СтрокаИнструмента.Имя;
		ОписаниеИнструмента = СтрокаИнструмента.Описание;
		
		// Проверяем, упоминается ли инструмент в запросе
		Если СтрНайти(ТекстЗапросаВерхний, ВРег(ИмяИнструмента)) > 0 
			Или СтрНайти(ВРег(ОписаниеИнструмента), ТекстЗапросаВерхний) > 0 Тогда
			
			Инструмент = Новый Структура;
			Инструмент.Вставить("Имя", ИмяИнструмента);
			Инструмент.Вставить("Параметры", ИзвлечьПараметрыИзЗапроса(ТекстЗапроса, ИмяИнструмента));
			НеобходимыеИнструменты.Добавить(Инструмент);
		КонецЕсли;
	КонецЦикла;
	
	// Если не найдено инструментов, но запрос явно требует работы с данными
	Если НеобходимыеИнструменты.Количество() = 0 Тогда
		КлючевыеСлова = Новый Массив;
		КлючевыеСлова.Добавить("СПРАВОЧНИК");
		КлючевыеСлова.Добавить("ДОКУМЕНТ");
		КлючевыеСлова.Добавить("РЕГИСТР");
		КлючевыеСлова.Добавить("ЗАПРОС");
		КлючевыеСлова.Добавить("ДАННЫЕ");
		КлючевыеСлова.Добавить("МЕТАДАННЫЕ");
		
		Для Каждого КлючевоеСлово Из КлючевыеСлова Цикл
			Если СтрНайти(ТекстЗапросаВерхний, КлючевоеСлово) > 0 Тогда
				// Предлагаем инструмент для работы с данными
				Инструмент = Новый Структура;
				Инструмент.Вставить("Имя", "mcp_ИнструментДанныеИзБД");
				Инструмент.Вставить("Параметры", Новый Структура);
				НеобходимыеИнструменты.Добавить(Инструмент);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат НеобходимыеИнструменты;
	
КонецФункции

// Выполняет MCP инструмент
//
// Параметры:
//  ИмяИнструмента - Строка - имя инструмента
//  Параметры - Структура - параметры для инструмента
//
// Возвращаемое значение:
//  Строка - текстовое представление результата
//
Функция ВыполнитьИнструментMCP(ИмяИнструмента, Параметры) Экспорт
	
	ТаблицаИнструментов = mcp_КонтейнерыПовтИсп.Инструменты();
	СтрокаИнструмента = ТаблицаИнструментов.Найти(ИмяИнструмента, "Имя");
	
	Если СтрокаИнструмента = Неопределено Тогда
		Возврат СтрШаблон("Инструмент '%1' не найден", ИмяИнструмента);
	КонецЕсли;
	
	Попытка
		Результат = mcp_Выполнение.ВыполнитьИнструмент(СтрокаИнструмента, Параметры);
		
		// Преобразуем результат в текст
		Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("content") Тогда
			МассивСодержимого = Результат.content;
			ТекстРезультата = "";
			Для Каждого Элемент Из МассивСодержимого Цикл
				Если ТипЗнч(Элемент) = Тип("Структура") И Элемент.Свойство("text") Тогда
					ТекстРезультата = ТекстРезультата + Элемент.text + Символы.ПС;
				КонецЕсли;
			КонецЦикла;
			Возврат ТекстРезультата;
		Иначе
			Возврат Строка(Результат);
		КонецЕсли;
		
	Исключение
		Возврат СтрШаблон("Ошибка выполнения инструмента '%1': %2", 
			ИмяИнструмента, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецФункции

// Получает историю диалога из регистра
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  Сессия - Строка
//
// Возвращаемое значение:
//  ТаблицаЗначений - история диалога
//
Функция ПолучитьИсториюДиалога(Пользователь, Сессия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	mcp_ИсторияДиалогов.Роль КАК Роль,
		|	mcp_ИсторияДиалогов.ТекстСообщения КАК ТекстСообщения,
		|	mcp_ИсторияДиалогов.ВремяСообщения КАК ВремяСообщения
		|ИЗ
		|	РегистрСведений.mcp_ИсторияДиалогов КАК mcp_ИсторияДиалогов
		|ГДЕ
		|	mcp_ИсторияДиалогов.Пользователь = &Пользователь
		|	И mcp_ИсторияДиалогов.Сессия = &Сессия
		|
		|УПОРЯДОЧИТЬ ПО
		|	mcp_ИсторияДиалогов.ВремяСообщения";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Сессия", Сессия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Добавляет сообщение в историю диалога
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  Сессия - Строка
//  Роль - Строка - "user", "assistant" или "system"
//  ТекстСообщения - Строка
//  ИспользованныеИнструменты - Массив - список имен инструментов (необязательно)
//
Процедура ДобавитьСообщениеВИсторию(Пользователь, Сессия, Роль, ТекстСообщения, ИспользованныеИнструменты = Неопределено) Экспорт
	
	// Получаем уникальное время, чтобы избежать перезаписи записей
	ВремяСообщения = ПолучитьУникальноеВремяДляИстории(Пользователь, Сессия);
	
	// Используем менеджер записи для добавления одной записи без затирания существующих
	МенеджерЗаписи = РегистрыСведений.mcp_ИсторияДиалогов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Сессия = Сессия;
	МенеджерЗаписи.ВремяСообщения = ВремяСообщения;
	МенеджерЗаписи.Роль = Роль;
	МенеджерЗаписи.ТекстСообщения = ТекстСообщения;
	
	Если ИспользованныеИнструменты <> Неопределено И ТипЗнч(ИспользованныеИнструменты) = Тип("Массив") Тогда
		МенеджерЗаписи.ИспользованныеИнструменты = mcp_ОбщегоНазначения.СтруктураВJSON(ИспользованныеИнструменты);
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Очищает историю диалога для указанного пользователя и сессии
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  Сессия - Строка - идентификатор сессии
//
Процедура ОчиститьИсториюДиалога(Пользователь, Сессия) Экспорт
	
	НаборЗаписей = РегистрыСведений.mcp_ИсторияДиалогов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Сессия.Установить(Сессия);
	НаборЗаписей.Записать(); // Записываем пустой набор = удаляем все записи с этим отбором
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает уникальное время для записи в историю
// Если запись с таким временем уже существует - добавляет секунду
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - текущий пользователь
//  Сессия - Строка - идентификатор сессии
//
// Возвращаемое значение:
//  Дата - уникальное время для записи
//
Функция ПолучитьУникальноеВремяДляИстории(Пользователь, Сессия)
	
	ВремяСообщения = ТекущаяДатаСеанса();
	
	// Проверяем, есть ли уже запись с таким временем
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	mcp_ИсторияДиалогов.ВремяСообщения КАК ВремяСообщения
		|ИЗ
		|	РегистрСведений.mcp_ИсторияДиалогов КАК mcp_ИсторияДиалогов
		|ГДЕ
		|	mcp_ИсторияДиалогов.Пользователь = &Пользователь
		|	И mcp_ИсторияДиалогов.Сессия = &Сессия
		|	И mcp_ИсторияДиалогов.ВремяСообщения >= &ВремяСообщения
		|
		|УПОРЯДОЧИТЬ ПО
		|	mcp_ИсторияДиалогов.ВремяСообщения УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Сессия", Сессия);
	Запрос.УстановитьПараметр("ВремяСообщения", ВремяСообщения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		// Берём последнее время и добавляем 1 секунду
		ВремяСообщения = Выборка.ВремяСообщения + 1;
	КонецЕсли;
	
	Возврат ВремяСообщения;
	
КонецФункции

// Извлекает параметры для инструмента из текста запроса
//
// Параметры:
//  ТекстЗапроса - Строка
//  ИмяИнструмента - Строка
//
// Возвращаемое значение:
//  Структура - параметры инструмента
//
Функция ИзвлечьПараметрыИзЗапроса(ТекстЗапроса, ИмяИнструмента)
	
	Параметры = Новый Структура;
	
	// Базовая реализация - в будущем можно улучшить с помощью NLP
	// Пока возвращаем пустую структуру, параметры будут определяться моделью или пользователем
	
	Возврат Параметры;
	
КонецФункции

// Формирует текстовый контекст результатов выполнения инструментов
//
// Параметры:
//  РезультатыИнструментов - Структура - результаты выполнения инструментов
//
// Возвращаемое значение:
//  Строка - текстовое представление результатов
//
Функция СформироватьКонтекстИнструментов(РезультатыИнструментов)
	
	Если РезультатыИнструментов.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстКонтекста = "";
	
	Для Каждого Результат Из РезультатыИнструментов Цикл
		ТекстКонтекста = ТекстКонтекста + СтрШаблон("Инструмент '%1':%2%3%2", 
			Результат.Ключ, 
			Символы.ПС,
			Строка(Результат.Значение));
	КонецЦикла;
	
	Возврат ТекстКонтекста;
	
КонецФункции

// Обрабатывает запрос пользователя в фоновом режиме
// Используется для запуска через ФоновыеЗадания.Выполнить()
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса пользователя
//  Сессия - Строка - идентификатор сессии диалога
//  Пользователь - СправочникСсылка.Пользователи - пользователь
//  АдресРезультата - Строка - адрес во временном хранилище для записи результата
//
Процедура ОбработатьЗапросФоновое(ТекстЗапроса, Сессия, Пользователь, АдресРезультата) Экспорт
	
	Результат = ОбработатьЗапросПользователя(ТекстЗапроса, Пользователь, Сессия);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти
